### Pandas in Python

In [3]:
from urllib.request import urlretrieve
italy_covid_url = 'https://gist.githubusercontent.com/aakashns/f6a004fa20c84fec53262f9a8bfee775/raw/f309558b1cf5103424cef58e2ecb8704dcd4d74c/italy-covid-daywise.csv'

urlretrieve(italy_covid_url, 'italy-covid-daywise.csv')

('italy-covid-daywise.csv', <http.client.HTTPMessage at 0x22901e775b0>)

In [5]:
import pandas as pd

### pd.read_csv('address of csv file')
This function reads the csv file and return the pandas dataframe object (datastructure in pandas)

In [16]:
covid_df = pd.read_csv("italy-covid-daywise.csv")
covid_df

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

In [13]:
covid_df.info()
covid_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float64
 2   new_deaths  248 non-null    float64
 3   new_tests   135 non-null    float64
dtypes: float64(3), object(1)
memory usage: 7.9+ KB

         new_cases  new_deaths     new_tests
count   248.000000  248.000000    135.000000
mean   1094.818548  143.133065  31699.674074
std    1554.508002  227.105538  11622.209757
min    -148.000000  -31.000000   7841.000000
25%     123.000000    3.000000  25259.000000
50%     342.000000   17.000000  29545.000000
75%    1371.750000  175.250000  37711.000000
max    6557.000000  971.000000  95273.000000

### dataframe.info()
You can view some basic information about dataset

In [19]:
covid_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float64
 2   new_deaths  248 non-null    float64
 3   new_tests   135 non-null    float64
dtypes: float64(3), object(1)
memory usage: 7.9+ KB

### dataframe.describe()
It appears that each column contains values of a specific data type. You can view statistical information for numerical columns (mean, standard deviation, minimum/maximum values, and the number of non-empty values) using the `.describe` method.

In [20]:
covid_df.describe()

         new_cases  new_deaths     new_tests
count   248.000000  248.000000    135.000000
mean   1094.818548  143.133065  31699.674074
std    1554.508002  227.105538  11622.209757
min    -148.000000  -31.000000   7841.000000
25%     123.000000    3.000000  25259.000000
50%     342.000000   17.000000  29545.000000
75%    1371.750000  175.250000  37711.000000
max    6557.000000  971.000000  95273.000000

### dataframe.shape
You can also view number of rows and columns in a dataframe using `.shape` property

In [22]:
covid_df.shape

(248, 4)

## Retrieving data from dataframe

* You can retrieve data from pandas similar that how we retreive from `dictionary`
* In this we are retrieving the column `new_cases` and in pandas this column is store in a data structure called `Series.`

In [25]:
covid_df['new_cases']

0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
        ...
243    1444.0
244    1365.0
245     996.0
246     975.0
247    1326.0
Name: new_cases, Length: 248, dtype: float64

Values inside this column can be accessed using `indexing notation`

In [26]:
covid_df['new_cases'][247]

1326.0

Pandas also provide `.at` method to retrieve element at specific row and column
* Pass the index and the columns value inside `dataframe.at[index, 'column_name']`

In [28]:
covid_df.at[247, 'new_cases']

1326.0

Instead of using the indexing notation `[]` Pandas also provides accessing columns as properties of dataframe using `.` notation. However this method works for those columns whose name do not contains spaces or special characters

In [31]:
covid_df.new_cases

0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
        ...
243    1444.0
244    1365.0
245     996.0
246     975.0
247    1326.0
Name: new_cases, Length: 248, dtype: float64

Further, you can also pass list of columns you want to access using the indexing `[]` notation

In [32]:
covid_df[['new_cases','new_deaths']]

     new_cases  new_deaths
0          0.0         0.0
1          0.0         0.0
2          0.0         0.0
3          0.0         0.0
4          0.0         0.0
..         ...         ...
243     1444.0         1.0
244     1365.0         4.0
245      996.0         6.0
246      975.0         8.0
247     1326.0         6.0

[248 rows x 2 columns]

To copy whole dataframe to another dataframe `.copy()` method is used

In [34]:
covid_df_cpy = covid_df.copy()
covid_df_cpy

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

You can also access the data from dataframe row wise using `.loc[]` method.

In [37]:
covid_df.loc[234]

date          2020-08-21
new_cases          840.0
new_deaths           6.0
new_tests        44943.0
Name: 234, dtype: object

each retrieved row is also a `Series`

Accessing first `n` rows of a dataframe using `.head()` method

In [38]:
covid_df.head(5)

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN

Similarly, we can access last `n` rows of datarame using `.tail()` method

In [39]:
covid_df.tail(5)

           date  new_cases  new_deaths  new_tests
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

If you see a large number of `NaN` in a dataset, like in this `italy-covid-daywise` dataset `new_tests` have a bunch of `NaN` values
* We can find the first index that doesn't contain the `NaN` values using `.first_valid_index()` method

In [41]:
covid_df.new_tests.first_valid_index()

111

You can see that `111` was the first index where we got a valid value, i.e. the numbers of test were started reporting from that day

In [42]:
covid_df.loc[108:113]

           date  new_cases  new_deaths  new_tests
108  2020-04-17     3786.0       525.0        NaN
109  2020-04-18     3493.0       575.0        NaN
110  2020-04-19     3491.0       480.0        NaN
111  2020-04-20     3047.0       433.0     7841.0
112  2020-04-21     2256.0       454.0    28095.0
113  2020-04-22     2729.0       534.0    44248.0

so, `20/April/2020` was the first data where new_tests were started reporting

The `.sample` method is used to retreive a random sample of rows from a dataframe

## Analysing data from dataframe
Let's try to answer some of the questions related to our data

**Q: What are the total number of reported cases and deaths related to Covid-19 in Italy?**

In [46]:
total_cases = covid_df.new_cases.sum()
total_deaths = covid_df.new_deaths.sum()

print(f"The total number of cases reported is {total_cases} and total number of deaths recorded is {total_deaths} ")

The total number of cases reported is 271515.0 and total number of deaths recorded is 35497.0

**Q: What is the overall death rate (ratio of reported deaths to reported cases)?**

In [57]:
death_rate = covid_df.new_deaths.sum() / covid_df.new_cases.sum()
print(f"Overall reported death rate in Italy is: {death_rate * 100}%")

Overall reported death rate in Italy is: 13.073679170579894%

**Q: What is the overall number of tests conducted? A total of 935310 tests were conducted before daily test numbers were reported.**

In [59]:
initial_test = 935310
total_test = covid_df.new_tests.sum() + initial_test

In [62]:
print(f"Total number of covid tests conducted in italy is: {total_test}")

Total number of covid tests conducted in italy is: 5214766.0

**Q: What fraction of tests returned a positive result?**

In [64]:
positive_rate = total_cases / total_test 
print(f"Positivity rate in italy is: {positive_rate}")

Positivity rate in italy is: 0.05206657403227681

## Querying and sorting rows

Let's say we want only want to look at the days which had more than 1000 reported cases. We can use a boolean expression to check which rows satisfy this criterion.

In [67]:
high_new_cases = covid_df.new_cases > 1000
high_new_cases

0      False
1      False
2      False
3      False
4      False
       ...
243     True
244     True
245    False
246    False
247     True
Name: new_cases, Length: 248, dtype: bool

In [68]:
covid_df[high_new_cases]

           date  new_cases  new_deaths  new_tests
68   2020-03-08     1247.0        36.0        NaN
69   2020-03-09     1492.0       133.0        NaN
70   2020-03-10     1797.0        98.0        NaN
72   2020-03-12     2313.0       196.0        NaN
73   2020-03-13     2651.0       189.0        NaN
..          ...        ...         ...        ...
241  2020-08-28     1409.0         5.0    65135.0
242  2020-08-29     1460.0         9.0    64294.0
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
247  2020-09-03     1326.0         6.0        NaN

[72 rows x 4 columns]

We can also write this in a single line

In [69]:
covid_df[covid_df.new_cases > 1000]

           date  new_cases  new_deaths  new_tests
68   2020-03-08     1247.0        36.0        NaN
69   2020-03-09     1492.0       133.0        NaN
70   2020-03-10     1797.0        98.0        NaN
72   2020-03-12     2313.0       196.0        NaN
73   2020-03-13     2651.0       189.0        NaN
..          ...        ...         ...        ...
241  2020-08-28     1409.0         5.0    65135.0
242  2020-08-29     1460.0         9.0    64294.0
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
247  2020-09-03     1326.0         6.0        NaN

[72 rows x 4 columns]

**This can be pronounced as, show the dataframe of only those cases which have new_cases > 1000**

The data frame contains 72 rows, but only the first & last five rows are displayed by default with Jupyter for brevity. We can change some display options to view all the rows.

In [ ]:
from IPython.display import display
with pd.option_context('display.max_rows', 100):
    display(covid_df[covid_df.new_cases > 1000])

We can also formulate more complex queries that involve multiple columns. As an example, let's try to determine the days when the ratio of cases reported to tests conducted is higher than the overall `positive_rate`.

In [71]:
positive_rate

0.05206657403227681

In [73]:
high_positive_rate_df = covid_df[covid_df.new_cases / covid_df.new_tests > positive_rate]
high_positive_rate_df

           date  new_cases  new_deaths  new_tests
111  2020-04-20     3047.0       433.0     7841.0
112  2020-04-21     2256.0       454.0    28095.0
113  2020-04-22     2729.0       534.0    44248.0
114  2020-04-23     3370.0       437.0    37083.0
116  2020-04-25     3021.0       420.0    38676.0
117  2020-04-26     2357.0       415.0    24113.0
118  2020-04-27     2324.0       260.0    26678.0
120  2020-04-29     2091.0       382.0    38589.0
123  2020-05-02     1965.0       269.0    31231.0
124  2020-05-03     1900.0       474.0    27047.0
125  2020-05-04     1389.0       174.0    22999.0
128  2020-05-07     1444.0       369.0    13665.0

Adding a positive ratio column to our dataset

In [81]:
covid_df['positive_rate'] = covid_df.new_cases / covid_df.new_tests
type(covid_df)

pandas.core.frame.DataFrame

In [76]:
covid_df

           date  new_cases  new_deaths  new_tests  positive_rate
0    2019-12-31        0.0         0.0        NaN            NaN
1    2020-01-01        0.0         0.0        NaN            NaN
2    2020-01-02        0.0         0.0        NaN            NaN
3    2020-01-03        0.0         0.0        NaN            NaN
4    2020-01-04        0.0         0.0        NaN            NaN
..          ...        ...         ...        ...            ...
243  2020-08-30     1444.0         1.0    53541.0       0.026970
244  2020-08-31     1365.0         4.0    42583.0       0.032055
245  2020-09-01      996.0         6.0    54395.0       0.018311
246  2020-09-02      975.0         8.0        NaN            NaN
247  2020-09-03     1326.0         6.0        NaN            NaN

[248 rows x 5 columns]

## Removing a column from a dataset

In [82]:
# Inplace argument is used to make the changes permanent in dataframe
covid_df.drop(columns=['positive_rate'], inplace=True)

In [83]:
covid_df

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

### Sorting rows using column values

The rows can also be sorted by a specific column using `.sort_values`. Let's sort to identify the days with the highest number of cases, then chain it with the `head` method to list just the first ten results.

In [85]:
covid_df.sort_values('new_cases',ascending=False).head(10)

          date  new_cases  new_deaths  new_tests
82  2020-03-22     6557.0       795.0        NaN
87  2020-03-27     6153.0       660.0        NaN
81  2020-03-21     5986.0       625.0        NaN
89  2020-03-29     5974.0       887.0        NaN
88  2020-03-28     5959.0       971.0        NaN
83  2020-03-23     5560.0       649.0        NaN
80  2020-03-20     5322.0       429.0        NaN
85  2020-03-25     5249.0       743.0        NaN
90  2020-03-30     5217.0       758.0        NaN
86  2020-03-26     5210.0       685.0        NaN

It's look like that the highest number of cases were recorded in the month of march

In [90]:
covid_df.sort_values('new_deaths', ascending=False).head(10)

          date  new_cases  new_deaths  new_tests
88  2020-03-28     5959.0       971.0        NaN
89  2020-03-29     5974.0       887.0        NaN
92  2020-04-01     4053.0       839.0        NaN
91  2020-03-31     4050.0       810.0        NaN
82  2020-03-22     6557.0       795.0        NaN
95  2020-04-04     4585.0       764.0        NaN
94  2020-04-03     4668.0       760.0        NaN
90  2020-03-30     5217.0       758.0        NaN
85  2020-03-25     5249.0       743.0        NaN
93  2020-04-02     4782.0       727.0        NaN

### Working with date 
While we've looked at overall numbers for the cases, tests, positive rate, etc., it would also be useful to study these numbers on a month-by-month basis. The `date` column might come in handy here, as Pandas provides many utilities for working with dates.
* Converting to `datetime` using `pd.to_datetime(dataframe.date)`

In [91]:
covid_df.date

0      2019-12-31
1      2020-01-01
2      2020-01-02
3      2020-01-03
4      2020-01-04
          ...
243    2020-08-30
244    2020-08-31
245    2020-09-01
246    2020-09-02
247    2020-09-03
Name: date, Length: 248, dtype: object

As you see the current datatype for date is object, we need to convert it into a `datetime` column using `pd.to_datetime()`

In [93]:
covid_df['date'] = pd.to_datetime(covid_df.date)
covid_df.date

0     2019-12-31
1     2020-01-01
2     2020-01-02
3     2020-01-03
4     2020-01-04
         ...
243   2020-08-30
244   2020-08-31
245   2020-09-01
246   2020-09-02
247   2020-09-03
Name: date, Length: 248, dtype: datetime64[ns]

Extracting the `year`, `month`, `weekday`, `day` values using `DatetimeIndex` class

In [94]:
covid_df['year'] = pd.DatetimeIndex(covid_df.date).year 
covid_df['month'] = pd.DatetimeIndex(covid_df.date).month 
covid_df['weekday'] = pd.DatetimeIndex(covid_df.date).weekday 
covid_df['day'] = pd.DatetimeIndex(covid_df.date).day

In [95]:
covid_df

          date  new_cases  new_deaths  new_tests  year  month  weekday  day
0   2019-12-31        0.0         0.0        NaN  2019     12        1   31
1   2020-01-01        0.0         0.0        NaN  2020      1        2    1
2   2020-01-02        0.0         0.0        NaN  2020      1        3    2
3   2020-01-03        0.0         0.0        NaN  2020      1        4    3
4   2020-01-04        0.0         0.0        NaN  2020      1        5    4
..         ...        ...         ...        ...   ...    ...      ...  ...
243 2020-08-30     1444.0         1.0    53541.0  2020      8        6   30
244 2020-08-31     1365.0         4.0    42583.0  2020      8        0   31
245 2020-09-01      996.0         6.0    54395.0  2020      9        1    1
246 2020-09-02      975.0         8.0        NaN  2020      9        2    2
247 2020-09-03     1326.0         6.0        NaN  2020      9        3    3

[248 rows x 8 columns]

Let's check the overall metrics for month may

In [122]:
covid_df_may = covid_df[covid_df.month == 5]

In [123]:
covid_df_may_metrics = covid_df_may[['new_cases','new_tests','new_deaths']]

In [124]:
covid_may_totals = covid_df_may_metrics.sum()
covid_may_totals

new_cases       29073.0
new_tests     1078720.0
new_deaths       5658.0
dtype: float64

In [104]:
type(covid_may_totals)

pandas.core.series.Series

We can also combine the above statements

In [106]:
covid_may_totals = covid_df[covid_df.month == 5][['new_cases','new_deaths','new_tests']].sum()
covid_may_totals

new_cases       29073.0
new_deaths       5658.0
new_tests     1078720.0
dtype: float64

### Grouping and Aggregation

As a next step, we might want to summarize the day-wise data and create a new dataframe with month-wise data. We can use the `groupby` function to create a group for each month, select the columns we wish to aggregate, and aggregate them using the `sum` method.